[
  {
    "id":"2",
    "cardImage":"../assets/temp/images/2/3_terminal-complete.jpg",
    "title": "Make your WebStorm terminal great",
    "author": "Hayden",
    "preview": "Are you using Webstorm + git-bash + Windows? Integrate it all to make your terminal tasks super organized.",
    "pubDate": "1/22/17",
    "mainPoints": [
      "To change WebStorm's terminal shell to the git-bash shell you should change the terminal's shell path setting to <kbd>C:\\Program Files\\Git\\bin\\sh.exe</kbd>",
      "This is helpful for developers who want to take advantage of WebStorm's integrated terminal and still use bash commands in their shell."
    ],
    "url":"make-your-webstorm-terminal-great",
    "mdFileID":"a2"
  },
  {
    "id":"3",
    "cardImage":"../assets/temp/images/3/card_image.jpg",
    "title": "Cross media publishing project",
    "author": "Hayden",
    "preview": "An undergraduate group project to improve an information system",
    "pubDate": "1/25/17",
    "mainPoints": [
      "This project's main goal was to improve the organization of a set of existing help documents that had been published by our school’s publishing center",
      "The final deliverables were the republished documents in print and web format",
      "We used information schemas, xml markup and templating, and HTML and AJAX to create the project deliverables"
    ],
    "url":"cross-media-publishing-project",
    "mdFileID":"a3"
  },
  {
    "id":"4",
    "cardImage":"../assets/temp/images/4/card_image.jpg",
    "title": "School of Media Sciences app",
    "author": "Hayden",
    "preview": "A digital publishing app made with a beta Adobe publishing framework",
    "pubDate": "1/26/17",
    "mainPoints": [
      "I worked on this project over a ten week period with another student; we were advised by two of our professors from our program",
      "Our main goal was to create an interactive application, using new Adobe software, that showcased the School of Media Sciences at RIT to potential students, current students, and alumni"
    ],
    "url":"school-of-media-sciences-app",
    "mdFileID":"a4"
  },
  {
    "id":"5",
    "cardImage":"../assets/temp/images/5/new-slider_card.jpg",
    "title": "slideswell",
    "author": "Hayden",
    "preview": "A good looking, small, pure JavaScript slider",
    "pubDate": "2/8/17",
    "mainPoints": [
      "The goal of this project is to create an aesthetic slider for desktop and mobile projects that are trying to avoid including jQuery as a dependency.",
      "The slider supports click and touch events, and its appearance is modeled after the Spotify album slider."
    ],
    "url":"slideswell",
    "mdFileID":"a5"
  },
  {
    "id":"7",
    "cardImage":"../assets/temp/images/7/card-image.jpg",
    "title": "D3 data-binding and selections",
    "author": "Hayden",
    "preview": "An interactive visual showing a few key concepts of the JS visualization library D3.js",
    "pubDate": "3/5/17",
    "mainPoints": [
      "D3 joins data to visual elements so the data drives the visual",
      "D3 'selections' allow for unique visual changes for the different states of changing data"
    ],
    "url":"d3-data-bind-selections",
    "mdFileID":"a7"
  },
  {
    "id":"8",
    "cardImage":"../assets/temp/images/8/card-image.jpg",
    "title": "Color science lab app",
    "author": "Hayden",
    "preview": "A JavaScript and D3.js application that models a color science process for online students",
    "pubDate": "3/12/17",
    "mainPoints": [
      "This application uses D3.js to animate screen elements that model a color reading instrument and color samples",
      "Users can go through the processes of calibrating the instrument, reading samples and viewing the output, and downloading the generated data as a CSV",
      "The goal of the project was to give online students an opportunity to witness and interact with this real-life color science process"
    ],
    "url":"color-science-lab-app",
    "mdFileID":"a8"
  },
  {
    "id":"9",
    "cardImage":"../assets/temp/images/9/card-image.jpg",
    "title": "Task request form integrated with Asana",
    "author": "Hayden",
    "preview": "An application that improves the efficiency of a task submission and management system",
    "pubDate": "3/19/17",
    "mainPoints": [
      "The front-end of this app is a form that is customized to the many different task request types",
      "The form allows users and workers to quickly submit detailed task requests",
      "The front-end of the application is built primarily with HTML, JavaScript, jQuery, and Bootstrap",
      "The back-end of this application uses Node.js, Express.js, and Socket.io to integrate with Asana's API"
    ],
    "url":"task-request-form",
    "mdFileID":"a9"
  }
]

