[
  {
    "id":"2",
    "cardImage":"../assets/temp/images/3_terminal-complete.jpg",
    "title": "Using Git Bash in the native WebStorm terminal (Windows)",
    "author": "Hayden",
    "preview": "I use WebStorm as my IDE, and I use git-bash on Windows. WebStorm features an integrated terminal, but if you want to use the git-bash shell instead of the default windows shell you need to change the 'shell path' in the WebStorm terminal settings.",
    "pubDate": "1/22/17",
    "mainPoints": [
      "To change WebStorm's terminal shell to the git-bash shell you should change the terminal's shell path setting to <kbd>C:\\Program Files\\Git\\bin\\sh.exe</kbd>",
      "This is helpful for developers who want to take advantage of WebStorm's integrated terminal and still use bash commands in their shell."
    ],
    "mdFileID":"a2"
  },
  {
    "id":"3",
    "cardImage":"../assets/temp/images/3/cmp_image-pan.jpg",
    "title": "Cross media publishing project",
    "author": "Hayden",
    "preview": "An undergraduate group project which involved organizing and structuring information before publishing to multiple media",
    "pubDate": "1/25/17",
    "mainPoints": [
      "This project's main goal was to improve the organization of a set of existing help documents that had been published by our school’s publishing center",
      "The final deliverables were the republished documents in print and web format",
      "We used information schemas, xml markup and templating, and HTML and AJAX to create the project deliverables"
    ],
    "mdFileID":"a3"
  },
  {
    "id":"4",
    "cardImage":"../assets/temp/images/4/ipad2.jpg",
    "title": "School of Media Sciences app",
    "author": "Hayden",
    "preview": "A digital publishing app made with a beta Adobe publishing framework.",
    "pubDate": "1/26/17",
    "mainPoints": [
      "I worked on this project over a ten week period with another student; we were advised by two of our professors from our program",
      "Our main goal was to create an interactive application, using new Adobe software, that showcased the School of Media Sciences at RIT to potential students, current students, and alumni"
    ],
    "mdFileID":"a4"
  },
  {
    "id":"5",
    "cardImage":"../assets/temp/images/4/ipad2.jpg",
    "title": "slide-swell",
    "author": "Hayden",
    "preview": "A good looking, small, pure JavaScript slider",
    "pubDate": "2/8/17",
    "mainPoints": [
      "The goal of this project is to create an aesthetic slider for desktop and mobile projects that are trying to avoid including jQuery as a dependency.",
      "The slider supports click and touch events, and its appearance is modeled after the Spotify album slider."
    ],
    "mdFileID":"a5"
  },
  {
    "id":"6",
    "cardImage":"../assets/temp/images/4/ipad2.jpg",
    "title": "Meta site post",
    "author": "Hayden",
    "preview": "META!",
    "pubDate": "2/8/17",
    "mainPoints": [
      "This website's framework is a bit ridiculous",
      "The content is currently not ground-breaking",
      "They serve a purpose for me to learn and improve as a developer"
    ],
    "mdFileID":"a6"
  }
]

